OpenNuvoton/NuTool-PinConfigure/Header/M030G/sys.h
/* PA.14 MFP */
#define SYS_GPA_MFPH_PA14MFP_GPIO       (0x00UL<<SYS_GPA_MFPH_PA14MFP_Pos)  /*!< GPA_MFPH PA14 setting for GPIO         \hideinitializer */
#define SYS_GPA_MFPH_PA14MFP_UART0_TXD  (0x03UL<<SYS_GPA_MFPH_PA14MFP_Pos)  /*!< GPA_MFPH PA14 setting for UART0_TXD    \hideinitializer */
#define SYS_GPA_MFPH_PA14MFP_I2C1_SCL   (0x04UL<<SYS_GPA_MFPH_PA14MFP_Pos)  /*!< GPA_MFPH PA14 setting for I2C1_SCL     \hideinitializer */
#define SYS_GPA_MFPH_PA14MFP_BPWM1_CH4  (0x0BUL<<SYS_GPA_MFPH_PA14MFP_Pos)  /*!< GPA_MFPH PA14 setting for BPWM1_CH4    \hideinitializer */
#define SYS_GPA_MFPH_PA14MFP_TM4_EXT    (0x0EUL<<SYS_GPA_MFPH_PA14MFP_Pos)  /*!< GPA_MFPH PA14 setting for TM4_EXT      \hideinitializer */

/* PA.15 MFP */
#define SYS_GPA_MFPH_PA15MFP_GPIO       (0x00UL<<SYS_GPA_MFPH_PA15MFP_Pos)  /*!< GPA_MFPH PA15 setting for GPIO         \hideinitializer */
#define SYS_GPA_MFPH_PA15MFP_UART0_RXD  (0x03UL<<SYS_GPA_MFPH_PA15MFP_Pos)  /*!< GPA_MFPH PA15 setting for UART0_RXD    \hideinitializer */
#define SYS_GPA_MFPH_PA15MFP_BPWM1_CH5  (0x0BUL<<SYS_GPA_MFPH_PA15MFP_Pos)  /*!< GPA_MFPH PA15 setting for BPWM1_CH5    \hideinitializer */
#define SYS_GPA_MFPH_PA15MFP_TM5_EXT    (0x0EUL<<SYS_GPA_MFPH_PA15MFP_Pos)  /*!< GPA_MFPH PA15 setting for TM5_EXT      \hideinitializer */

/* PB.0 MFP */
#define SYS_GPB_MFPL_PB0MFP_GPIO        (0x00UL<<SYS_GPB_MFPL_PB0MFP_Pos)   /*!< GPB_MFPL PB0 setting for GPIO          \hideinitializer */
#define SYS_GPB_MFPL_PB0MFP_ADC0_CH0    (0x01UL<<SYS_GPB_MFPL_PB0MFP_Pos)   /*!< GPB_MFPL PB0 setting for ADC0_CH0      \hideinitializer */
#define SYS_GPB_MFPL_PB0MFP_I2C1_SDA    (0x09UL<<SYS_GPB_MFPL_PB0MFP_Pos)   /*!< GPB_MFPL PB0 setting for I2C1_SDA      \hideinitializer */

/* PB.1 MFP */
#define SYS_GPB_MFPL_PB1MFP_GPIO        (0x00UL<<SYS_GPB_MFPL_PB1MFP_Pos)   /*!< GPB_MFPL PB1 setting for GPIO          \hideinitializer */
#define SYS_GPB_MFPL_PB1MFP_ADC0_CH1    (0x01UL<<SYS_GPB_MFPL_PB1MFP_Pos)   /*!< GPB_MFPL PB1 setting for ADC0_CH1      \hideinitializer */
#define SYS_GPB_MFPL_PB1MFP_UART0_RXD   (0x03UL<<SYS_GPB_MFPL_PB1MFP_Pos)   /*!< GPB_MFPL PB1 setting for UART0_RXD     \hideinitializer */
#define SYS_GPB_MFPL_PB1MFP_I2C1_SDA    (0x04UL<<SYS_GPB_MFPL_PB1MFP_Pos)   /*!< GPB_MFPL PB1 setting for I2C1_SDA      \hideinitializer */
#define SYS_GPB_MFPL_PB1MFP_I2C1_SCL    (0x09UL<<SYS_GPB_MFPL_PB1MFP_Pos)   /*!< GPB_MFPL PB1 setting for I2C1_SCL      \hideinitializer */
#define SYS_GPB_MFPL_PB1MFP_BPWM1_CH4   (0x0EUL<<SYS_GPB_MFPL_PB1MFP_Pos)   /*!< GPB_MFPL PB1 setting for BPWM1_CH4     \hideinitializer */

/* PB.2 MFP */
#define SYS_GPB_MFPL_PB2MFP_GPIO        (0x00UL<<SYS_GPB_MFPL_PB2MFP_Pos)   /*!< GPB_MFPL PB2 setting for GPIO          \hideinitializer */
#define SYS_GPB_MFPL_PB2MFP_ADC0_CH2    (0x01UL<<SYS_GPB_MFPL_PB2MFP_Pos)   /*!< GPB_MFPL PB2 setting for ADC0_CH2      \hideinitializer */
#define SYS_GPB_MFPL_PB2MFP_I2C1_SDA    (0x04UL<<SYS_GPB_MFPL_PB2MFP_Pos)   /*!< GPB_MFPL PB2 setting for I2C1_SDA      \hideinitializer */
#define SYS_GPB_MFPL_PB2MFP_TM5         (0x05UL<<SYS_GPB_MFPL_PB2MFP_Pos)   /*!< GPB_MFPL PB2 setting for TM5           \hideinitializer */
#define SYS_GPB_MFPL_PB2MFP_I2C1_SCL    (0x09UL<<SYS_GPB_MFPL_PB2MFP_Pos)   /*!< GPB_MFPL PB2 setting for I2C1_SCL      \hideinitializer */
#define SYS_GPB_MFPL_PB2MFP_BPWM1_CH3   (0x0AUL<<SYS_GPB_MFPL_PB2MFP_Pos)   /*!< GPB_MFPL PB2 setting for BPWM1_CH3     \hideinitializer */
#define SYS_GPB_MFPL_PB2MFP_TM1         (0x0CUL<<SYS_GPB_MFPL_PB2MFP_Pos)   /*!< GPB_MFPL PB2 setting for TM1           \hideinitializer */
#define SYS_GPB_MFPL_PB2MFP_MANCH_RXD   (0x0DUL<<SYS_GPB_MFPL_PB2MFP_Pos)   /*!< GPB_MFPL PB2 setting for MANCH_RXD     \hideinitializer */
#define SYS_GPB_MFPL_PB2MFP_TM3         (0x0EUL<<SYS_GPB_MFPL_PB2MFP_Pos)   /*!< GPB_MFPL PB2 setting for TM3           \hideinitializer */
#define SYS_GPB_MFPL_PB2MFP_INT3        (0x0FUL<<SYS_GPB_MFPL_PB2MFP_Pos)   /*!< GPB_MFPL PB2 setting for INT3          \hideinitializer */

/* PB.3 MFP */
#define SYS_GPB_MFPL_PB3MFP_GPIO        (0x00UL<<SYS_GPB_MFPL_PB3MFP_Pos)   /*!< GPB_MFPL PB3 setting for GPIO          \hideinitializer */
#define SYS_GPB_MFPL_PB3MFP_ADC0_CH3    (0x01UL<<SYS_GPB_MFPL_PB3MFP_Pos)   /*!< GPB_MFPL PB3 setting for ADC0_CH3      \hideinitializer */
#define SYS_GPB_MFPL_PB3MFP_I2C1_SCL    (0x04UL<<SYS_GPB_MFPL_PB3MFP_Pos)   /*!< GPB_MFPL PB3 setting for I2C1_SCL      \hideinitializer */
#define SYS_GPB_MFPL_PB3MFP_TM4         (0x09UL<<SYS_GPB_MFPL_PB3MFP_Pos)   /*!< GPB_MFPL PB3 setting for TM4           \hideinitializer */
#define SYS_GPB_MFPL_PB3MFP_BPWM1_CH2   (0x0AUL<<SYS_GPB_MFPL_PB3MFP_Pos)   /*!< GPB_MFPL PB3 setting for BPWM1_CH2     \hideinitializer */
#define SYS_GPB_MFPL_PB3MFP_TM0         (0x0CUL<<SYS_GPB_MFPL_PB3MFP_Pos)   /*!< GPB_MFPL PB3 setting for TM0           \hideinitializer */
#define SYS_GPB_MFPL_PB3MFP_MANCH_TXD   (0x0DUL<<SYS_GPB_MFPL_PB3MFP_Pos)   /*!< GPB_MFPL PB3 setting for MANCH_TXD     \hideinitializer */
#define SYS_GPB_MFPL_PB3MFP_TM2         (0x0EUL<<SYS_GPB_MFPL_PB3MFP_Pos)   /*!< GPB_MFPL PB3 setting for TM2           \hideinitializer */
#define SYS_GPB_MFPL_PB3MFP_INT2        (0x0FUL<<SYS_GPB_MFPL_PB3MFP_Pos)   /*!< GPB_MFPL PB3 setting for INT2          \hideinitializer */

/* PB.4 MFP */
#define SYS_GPB_MFPL_PB4MFP_GPIO        (0x00UL<<SYS_GPB_MFPL_PB4MFP_Pos)   /*!< GPB_MFPL PB4 setting for GPIO          \hideinitializer */
#define SYS_GPB_MFPL_PB4MFP_ADC0_CH4    (0x01UL<<SYS_GPB_MFPL_PB4MFP_Pos)   /*!< GPB_MFPL PB4 setting for ADC0_CH4      \hideinitializer */
#define SYS_GPB_MFPL_PB4MFP_I2C0_SDA    (0x06UL<<SYS_GPB_MFPL_PB4MFP_Pos)   /*!< GPB_MFPL PB4 setting for I2C0_SDA      \hideinitializer */
#define SYS_GPB_MFPL_PB4MFP_TM1         (0x0EUL<<SYS_GPB_MFPL_PB4MFP_Pos)   /*!< GPB_MFPL PB4 setting for TM1           \hideinitializer */
#define SYS_GPB_MFPL_PB4MFP_INT1        (0x0FUL<<SYS_GPB_MFPL_PB4MFP_Pos)   /*!< GPB_MFPL PB4 setting for INT1          \hideinitializer */

/* PB.5 MFP */
#define SYS_GPB_MFPL_PB5MFP_GPIO        (0x00UL<<SYS_GPB_MFPL_PB5MFP_Pos)   /*!< GPB_MFPL PB5 setting for GPIO          \hideinitializer */
#define SYS_GPB_MFPL_PB5MFP_ADC0_CH5    (0x01UL<<SYS_GPB_MFPL_PB5MFP_Pos)   /*!< GPB_MFPL PB5 setting for ADC0_CH5      \hideinitializer */
#define SYS_GPB_MFPL_PB5MFP_I2C0_SCL    (0x06UL<<SYS_GPB_MFPL_PB5MFP_Pos)   /*!< GPB_MFPL PB5 setting for I2C0_SCL      \hideinitializer */
#define SYS_GPB_MFPL_PB5MFP_TM0         (0x0EUL<<SYS_GPB_MFPL_PB5MFP_Pos)   /*!< GPB_MFPL PB5 setting for TM0           \hideinitializer */
#define SYS_GPB_MFPL_PB5MFP_INT0        (0x0FUL<<SYS_GPB_MFPL_PB5MFP_Pos)   /*!< GPB_MFPL PB5 setting for INT0          \hideinitializer */

