OpenNuvoton/NuTool-PinConfigure/Header/M030G/sys.h
/* PB.6 MFP */
#define SYS_GPB_MFPL_PB6MFP_GPIO        (0x00UL<<SYS_GPB_MFPL_PB6MFP_Pos)   /*!< GPB_MFPL PB6 setting for GPIO          \hideinitializer */
#define SYS_GPB_MFPL_PB6MFP_ADC0_CH6    (0x01UL<<SYS_GPB_MFPL_PB6MFP_Pos)   /*!< GPB_MFPL PB6 setting for ADC0_CH6      \hideinitializer */
#define SYS_GPB_MFPL_PB6MFP_MANCH_RXD   (0x09UL<<SYS_GPB_MFPL_PB6MFP_Pos)   /*!< GPB_MFPL PB6 setting for MANCH_RXD     \hideinitializer */
#define SYS_GPB_MFPL_PB6MFP_BPWM1_CH5   (0x0AUL<<SYS_GPB_MFPL_PB6MFP_Pos)   /*!< GPB_MFPL PB6 setting for BPWM1_CH5     \hideinitializer */
#define SYS_GPB_MFPL_PB6MFP_INT4        (0x0DUL<<SYS_GPB_MFPL_PB6MFP_Pos)   /*!< GPB_MFPL PB6 setting for INT4          \hideinitializer */

/* PB.7 MFP */
#define SYS_GPB_MFPL_PB7MFP_GPIO        (0x00UL<<SYS_GPB_MFPL_PB7MFP_Pos)   /*!< GPB_MFPL PB7 setting for GPIO          \hideinitializer */
#define SYS_GPB_MFPL_PB7MFP_ADC0_CH7    (0x01UL<<SYS_GPB_MFPL_PB7MFP_Pos)   /*!< GPB_MFPL PB7 setting for ADC0_CH7      \hideinitializer */
#define SYS_GPB_MFPL_PB7MFP_MANCH_TXD   (0x09UL<<SYS_GPB_MFPL_PB7MFP_Pos)   /*!< GPB_MFPL PB7 setting for MANCH_TXD     \hideinitializer */
#define SYS_GPB_MFPL_PB7MFP_BPWM1_CH4   (0x0AUL<<SYS_GPB_MFPL_PB7MFP_Pos)   /*!< GPB_MFPL PB7 setting for BPWM1_CH4     \hideinitializer */
#define SYS_GPB_MFPL_PB7MFP_INT5        (0x0DUL<<SYS_GPB_MFPL_PB7MFP_Pos)   /*!< GPB_MFPL PB7 setting for INT5          \hideinitializer */

/* PB.8 MFP */
#define SYS_GPB_MFPH_PB8MFP_GPIO        (0x00UL<<SYS_GPB_MFPH_PB8MFP_Pos)   /*!< GPB_MFPH PB8 setting for GPIO          \hideinitializer */
#define SYS_GPB_MFPH_PB8MFP_ADC0_CH8    (0x01UL<<SYS_GPB_MFPH_PB8MFP_Pos)   /*!< GPB_MFPH PB8 setting for ADC0_CH8      \hideinitializer */
#define SYS_GPB_MFPH_PB8MFP_UART0_RXD   (0x05UL<<SYS_GPB_MFPH_PB8MFP_Pos)   /*!< GPB_MFPH PB8 setting for UART0_RXD     \hideinitializer */
#define SYS_GPB_MFPH_PB8MFP_BPWM1_CH3   (0x0AUL<<SYS_GPB_MFPH_PB8MFP_Pos)   /*!< GPB_MFPH PB8 setting for BPWM1_CH3     \hideinitializer */

/* PB.9 MFP */
#define SYS_GPB_MFPH_PB9MFP_GPIO        (0x00UL<<SYS_GPB_MFPH_PB9MFP_Pos)   /*!< GPB_MFPH PB9 setting for GPIO          \hideinitializer */
#define SYS_GPB_MFPH_PB9MFP_ADC0_CH9    (0x01UL<<SYS_GPB_MFPH_PB9MFP_Pos)   /*!< GPB_MFPH PB9 setting for ADC0_CH9      \hideinitializer */
#define SYS_GPB_MFPH_PB9MFP_UART0_TXD   (0x05UL<<SYS_GPB_MFPH_PB9MFP_Pos)   /*!< GPB_MFPH PB9 setting for UART0_TXD     \hideinitializer */
#define SYS_GPB_MFPH_PB9MFP_BPWM1_CH2   (0x0AUL<<SYS_GPB_MFPH_PB9MFP_Pos)   /*!< GPB_MFPH PB9 setting for BPWM1_CH2     \hideinitializer */

/* PB.10 MFP */
#define SYS_GPB_MFPH_PB10MFP_GPIO       (0x00UL<<SYS_GPB_MFPH_PB10MFP_Pos)  /*!< GPB_MFPH PB10 setting for GPIO         \hideinitializer */
#define SYS_GPB_MFPH_PB10MFP_ADC0_CH10  (0x01UL<<SYS_GPB_MFPH_PB10MFP_Pos)  /*!< GPB_MFPH PB10 setting for ADC0_CH10    \hideinitializer */
#define SYS_GPB_MFPH_PB10MFP_UART0_nRTS (0x05UL<<SYS_GPB_MFPH_PB10MFP_Pos)  /*!< GPB_MFPH PB10 setting for UART0_nRTS   \hideinitializer */
#define SYS_GPB_MFPH_PB10MFP_I2C1_SDA   (0x07UL<<SYS_GPB_MFPH_PB10MFP_Pos)  /*!< GPB_MFPH PB10 setting for I2C1_SDA     \hideinitializer */
#define SYS_GPB_MFPH_PB10MFP_BPWM1_CH1  (0x0AUL<<SYS_GPB_MFPH_PB10MFP_Pos)  /*!< GPB_MFPH PB10 setting for BPWM1_CH1    \hideinitializer */

/* PB.11 MFP */
#define SYS_GPB_MFPH_PB11MFP_GPIO       (0x00UL<<SYS_GPB_MFPH_PB11MFP_Pos)  /*!< GPB_MFPH PB11 setting for GPIO         \hideinitializer */
#define SYS_GPB_MFPH_PB11MFP_ADC0_CH11  (0x01UL<<SYS_GPB_MFPH_PB11MFP_Pos)  /*!< GPB_MFPH PB11 setting for ADC0_CH11    \hideinitializer */
#define SYS_GPB_MFPH_PB11MFP_UART0_nCTS (0x05UL<<SYS_GPB_MFPH_PB11MFP_Pos)  /*!< GPB_MFPH PB11 setting for UART0_nCTS   \hideinitializer */
#define SYS_GPB_MFPH_PB11MFP_UART0_TXD  (0x06UL<<SYS_GPB_MFPH_PB11MFP_Pos)  /*!< GPB_MFPH PB11 setting for UART0_TXD    \hideinitializer */
#define SYS_GPB_MFPH_PB11MFP_I2C1_SCL   (0x07UL<<SYS_GPB_MFPH_PB11MFP_Pos)  /*!< GPB_MFPH PB11 setting for I2C1_SCL     \hideinitializer */
#define SYS_GPB_MFPH_PB11MFP_BPWM1_CH0  (0x0AUL<<SYS_GPB_MFPH_PB11MFP_Pos)  /*!< GPB_MFPH PB11 setting for BPWM1_CH0    \hideinitializer */
#define SYS_GPB_MFPH_PB11MFP_EXTCLK_IN  (0x0EUL<<SYS_GPB_MFPH_PB11MFP_Pos)  /*!< GPB_MFPH PB11 setting for EXTCLK_IN    \hideinitializer */
#define SYS_GPB_MFPH_PB11MFP_MANCH_RXD  (0x0FUL<<SYS_GPB_MFPH_PB11MFP_Pos)  /*!< GPB_MFPH PB11 setting for MANCH_RXD    \hideinitializer */

/* PB.12 MFP */
#define SYS_GPB_MFPH_PB12MFP_GPIO       (0x00UL<<SYS_GPB_MFPH_PB12MFP_Pos)  /*!< GPB_MFPH PB12 setting for GPIO         \hideinitializer */
#define SYS_GPB_MFPH_PB12MFP_ADC0_CH12  (0x01UL<<SYS_GPB_MFPH_PB12MFP_Pos)  /*!< GPB_MFPH PB12 setting for ADC0_CH12    \hideinitializer */
#define SYS_GPB_MFPH_PB12MFP_SPI0_MOSI  (0x04UL<<SYS_GPB_MFPH_PB12MFP_Pos)  /*!< GPB_MFPH PB12 setting for SPI0_MOSI    \hideinitializer */
#define SYS_GPB_MFPH_PB12MFP_UART0_RXD  (0x06UL<<SYS_GPB_MFPH_PB12MFP_Pos)  /*!< GPB_MFPH PB12 setting for UART0_RXD    \hideinitializer */
#define SYS_GPB_MFPH_PB12MFP_EXTCLK_IN  (0x09UL<<SYS_GPB_MFPH_PB12MFP_Pos)  /*!< GPB_MFPH PB12 setting for EXTCLK_IN    \hideinitializer */
#define SYS_GPB_MFPH_PB12MFP_TM5_EXT    (0x0AUL<<SYS_GPB_MFPH_PB12MFP_Pos)  /*!< GPB_MFPH PB12 setting for TM5_EXT      \hideinitializer */
#define SYS_GPB_MFPH_PB12MFP_BPWM1_CH2  (0x0CUL<<SYS_GPB_MFPH_PB12MFP_Pos)  /*!< GPB_MFPH PB12 setting for BPWM1_CH2    \hideinitializer */
#define SYS_GPB_MFPH_PB12MFP_TM3_EXT    (0x0DUL<<SYS_GPB_MFPH_PB12MFP_Pos)  /*!< GPB_MFPH PB12 setting for TM3_EXT      \hideinitializer */
#define SYS_GPB_MFPH_PB12MFP_TM1_EXT    (0x0EUL<<SYS_GPB_MFPH_PB12MFP_Pos)  /*!< GPB_MFPH PB12 setting for TM1_EXT      \hideinitializer */
#define SYS_GPB_MFPH_PB12MFP_MANCH_TXD  (0x0FUL<<SYS_GPB_MFPH_PB12MFP_Pos)  /*!< GPB_MFPH PB12 setting for MANCH_TXD    \hideinitializer */

/* PB.13 MFP */
#define SYS_GPB_MFPH_PB13MFP_GPIO       (0x00UL<<SYS_GPB_MFPH_PB13MFP_Pos)  /*!< GPB_MFPH PB13 setting for GPIO         \hideinitializer */
#define SYS_GPB_MFPH_PB13MFP_ADC0_CH13  (0x01UL<<SYS_GPB_MFPH_PB13MFP_Pos)  /*!< GPB_MFPH PB13 setting for ADC0_CH13    \hideinitializer */
#define SYS_GPB_MFPH_PB13MFP_SPI0_MISO  (0x04UL<<SYS_GPB_MFPH_PB13MFP_Pos)  /*!< GPB_MFPH PB13 setting for SPI0_MISO    \hideinitializer */
#define SYS_GPB_MFPH_PB13MFP_UART0_TXD  (0x06UL<<SYS_GPB_MFPH_PB13MFP_Pos)  /*!< GPB_MFPH PB13 setting for UART0_TXD    \hideinitializer */
#define SYS_GPB_MFPH_PB13MFP_TM4_EXT    (0x0AUL<<SYS_GPB_MFPH_PB13MFP_Pos)  /*!< GPB_MFPH PB13 setting for TM4_EXT      \hideinitializer */
#define SYS_GPB_MFPH_PB13MFP_TM2_EXT    (0x0DUL<<SYS_GPB_MFPH_PB13MFP_Pos)  /*!< GPB_MFPH PB13 setting for TM2_EXT      \hideinitializer */
#define SYS_GPB_MFPH_PB13MFP_TM0_EXT    (0x0EUL<<SYS_GPB_MFPH_PB13MFP_Pos)  /*!< GPB_MFPH PB13 setting for TM0_EXT      \hideinitializer */

/* PB.14 MFP */
#define SYS_GPB_MFPH_PB14MFP_GPIO       (0x00UL<<SYS_GPB_MFPH_PB14MFP_Pos)  /*!< GPB_MFPH PB14 setting for GPIO         \hideinitializer */
#define SYS_GPB_MFPH_PB14MFP_ADC0_CH14  (0x01UL<<SYS_GPB_MFPH_PB14MFP_Pos)  /*!< GPB_MFPH PB14 setting for ADC0_CH14    \hideinitializer */
#define SYS_GPB_MFPH_PB14MFP_SPI0_CLK   (0x04UL<<SYS_GPB_MFPH_PB14MFP_Pos)  /*!< GPB_MFPH PB14 setting for SPI0_CLK     \hideinitializer */
#define SYS_GPB_MFPH_PB14MFP_UART0_nRTS (0x06UL<<SYS_GPB_MFPH_PB14MFP_Pos)  /*!< GPB_MFPH PB14 setting for UART0_nRTS   \hideinitializer */
#define SYS_GPB_MFPH_PB14MFP_TM1_EXT    (0x0DUL<<SYS_GPB_MFPH_PB14MFP_Pos)  /*!< GPB_MFPH PB14 setting for TM1_EXT      \hideinitializer */
#define SYS_GPB_MFPH_PB14MFP_CLKO       (0x0EUL<<SYS_GPB_MFPH_PB14MFP_Pos)  /*!< GPB_MFPH PB14 setting for CLKO         \hideinitializer */

/* PB.15 MFP */
#define SYS_GPB_MFPH_PB15MFP_GPIO       (0x00UL<<SYS_GPB_MFPH_PB15MFP_Pos)  /*!< GPB_MFPH PB15 setting for GPIO         \hideinitializer */
#define SYS_GPB_MFPH_PB15MFP_ADC0_CH15  (0x01UL<<SYS_GPB_MFPH_PB15MFP_Pos)  /*!< GPB_MFPH PB15 setting for ADC0_CH15    \hideinitializer */
#define SYS_GPB_MFPH_PB15MFP_SPI0_SS    (0x04UL<<SYS_GPB_MFPH_PB15MFP_Pos)  /*!< GPB_MFPH PB15 setting for SPI0_SS      \hideinitializer */
#define SYS_GPB_MFPH_PB15MFP_UART0_nCTS (0x06UL<<SYS_GPB_MFPH_PB15MFP_Pos)  /*!< GPB_MFPH PB15 setting for UART0_nCTS   \hideinitializer */
#define SYS_GPB_MFPH_PB15MFP_TM0_EXT    (0x0DUL<<SYS_GPB_MFPH_PB15MFP_Pos)  /*!< GPB_MFPH PB15 setting for TM0_EXT      \hideinitializer */

/* PC.1 MFP */
#define SYS_GPC_MFPL_PC1MFP_GPIO        (0x00UL<<SYS_GPC_MFPL_PC1MFP_Pos)   /*!< GPC_MFPL PC1 setting for GPIO          \hideinitializer */
#define SYS_GPC_MFPL_PC1MFP_I2C1_SCL    (0x04UL<<SYS_GPC_MFPL_PC1MFP_Pos)   /*!< GPC_MFPL PC1 setting for I2C1_SCL      \hideinitializer */
#define SYS_GPC_MFPL_PC1MFP_I2C0_SCL    (0x09UL<<SYS_GPC_MFPL_PC1MFP_Pos)   /*!< GPC_MFPL PC1 setting for I2C0_SCL      \hideinitializer */
#define SYS_GPC_MFPL_PC1MFP_ADC0_ST     (0x0FUL<<SYS_GPC_MFPL_PC1MFP_Pos)   /*!< GPC_MFPL PC1 setting for ADC0_ST       \hideinitializer */

/* PF.0 MFP */
#define SYS_GPF_MFPL_PF0MFP_GPIO        (0x00UL<<SYS_GPF_MFPL_PF0MFP_Pos)   /*!< GPF_MFPL PF0 setting for GPIO          \hideinitializer */
#define SYS_GPF_MFPL_PF0MFP_ICE_DAT     (0x0EUL<<SYS_GPF_MFPL_PF0MFP_Pos)   /*!< GPF_MFPL PF0 setting for ICE_DAT       \hideinitializer */

